app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('New Title', 'This is a new post', '2024-08-05 12:28:10.278895', '2024-08-05 12:28:10.278895')
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'Updated Title', `posts`.`body` = 'This is an updated post', `posts`.`updated_at` = '2024-08-05 12:29:11.723716' WHERE `posts`.`id` = 1
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)